[
    {
        "id": 1,
        "estate_title": "Modern Apartment with Stunning View",
        "segment_name": "Luxury",
        "description": "Perched high above the city, this modern apartment offers a lifestyle of unparalleled luxury. The floor-to-ceiling windows provide breathtaking panoramic views of the skyline, creating an ambiance of serenity and sophistication. Step inside to discover meticulously designed interiors featuring spacious rooms adorned with elegant finishes and premium materials. The open-plan layout seamlessly integrates the living, dining, and kitchen areas, ideal for both relaxation and entertaining guests. State-of-the-art amenities await, including a fully equipped fitness center, refreshing swimming pool, and serene rooftop garden. Located in the vibrant heart of downtown, residents have easy access to an array of dining, shopping, and entertainment options. Experience urban living at its finest in this exclusive residence where every detail has been thoughtfully curated to exceed expectations.",
        "price": "$500,000",
        "status": "sale",
        "area": "2000 sq ft",
        "apartment_id": "2354",
        "bed": "4",
        "bath": "3",
        "location": "Downtown",
        "facilities": [
            "living room",
            "swimming pool",
            "kitchen",
            "gym",
            "rooftop garden",
            "concierge service"
        ],
        "estate_image": "https://i.ibb.co/JCmp3p9/room-1.jpg",
        "agent_name": "John Smith",
        "agent_img": "https://i.ibb.co/09Sj4Sm/agent-1.jpg",
        "phone": "+1234567890",
        "email": "john.smith@example.com"
    },
    {
        "id": 2,
        "estate_title": "Cozy Apartment in Historic District",
        "segment_name": "Classic",
        "description": "Nestled within the charming streets of the historic district, this cozy apartment offers a retreat from the hustle and bustle of city life. Steeped in character and charm, the apartment boasts architectural details that pay homage to its storied past. Inside, warm hardwood floors and exposed brick walls create a welcoming ambiance, while large windows flood the space with natural light. The well-appointed kitchen features modern appliances and ample storage space, perfect for culinary enthusiasts. After a long day, unwind in the cozy living area or take a leisurely stroll through the neighborhood's tree-lined streets. With convenient access to boutique shops, quaint cafes, and cultural landmarks, residents can immerse themselves in the rich history and vibrant culture of the area. Experience the allure of classic living in this idyllic apartment nestled in the heart of the historic district.",
        "price": "$1,500/month",
        "status": "rent",
        "area": "1200 sq ft",
        "apartment_id": "1432",
        "bed": "4",
        "bath": "2",
        "location": "Old Town",
        "facilities": [
            "living room",
            "kitchen",
            "parking",
            "laundry",
            "gym",
            "garden"
        ],
        "estate_image": "https://i.ibb.co/JCmp3p9/room-1.jpg",
        "agent_name": "Emily Johnson",
        "agent_img": "https://i.ibb.co/RNktRtt/161962.jpg",
        "phone": "+1987654321",
        "email": "emily.johnson@example.com"
    },
    {
        "id": 3,
        "estate_title": "Spacious Penthouse with Panoramic Views",
        "segment_name": "Luxury",
        "description": "Indulge in the ultimate luxury living experience in this expansive penthouse offering unrivaled panoramic views of the city skyline. Situated atop a prestigious high-rise building, this residence epitomizes sophistication and refinement. Floor-to-ceiling windows throughout the home showcase the breathtaking vistas, while the open-concept layout accentuates the sense of space and light. High-end finishes and designer touches abound, from the gourmet kitchen with top-of-the-line appliances to the lavish master suite with a spa-like ensuite bathroom. Residents have exclusive access to a host of amenities, including a private gym, infinity-edge pool, and rooftop terrace perfect for entertaining. Located in the sought-after Skyline Heights neighborhood, this penthouse offers a lifestyle of unparalleled luxury and convenience, with fine dining, upscale shopping, and cultural attractions just moments away.",
        "price": "$2,000,000",
        "status": "sale",
        "area": "3000 sq ft",
        "apartment_id": "1567",
        "bed": "2",
        "bath": "3",
        "location": "Skyline Heights",
        "facilities": [
            "living room",
            "swimming pool",
            "gym",
            "kitchen",
            "balcony",
            "sauna",
            "private elevator"
        ],
        "estate_image": "https://i.ibb.co/JCmp3p9/room-1.jpg",
        "agent_name": "Michael Brown",
        "agent_img": "https://i.ibb.co/1v3VMNC/21887.jpg",
        "phone": "+1122334455",
        "email": "michael.brown@example.com"
    },
    {
        "id": 4,
        "estate_title": "Charming Studio Apartment",
        "segment_name": "Affordable",
        "description": "Discover the perfect blend of comfort and affordability in this charming studio apartment nestled in the heart of the bustling city center. Designed for modern urban living, the apartment features a functional layout with clever space-saving solutions and stylish finishes. The cozy living area is flooded with natural light, creating a warm and inviting atmosphere for relaxation and entertainment. The well-equipped kitchen boasts sleek cabinetry and modern appliances, making meal preparation a breeze. With convenient access to public transportation and a myriad of amenities at your doorstep, including trendy cafes, vibrant nightlife, and cultural attractions, this studio apartment offers the ideal urban lifestyle for those seeking convenience without compromise.",
        "price": "$900/month",
        "status": "rent",
        "area": "600 sq ft",
        "apartment_id": "2465",
        "bed": "4",
        "bath": "2",
        "location": "City Center",
        "facilities": [
            "living room",
            "kitchen",
            "gym",
            "swimming pool",
            "balcony",
            "concierge service"
        ],
        "estate_image": "https://i.ibb.co/JCmp3p9/room-1.jpg",
        "agent_name": "Jennifer Wilson",
        "agent_img": "https://i.ibb.co/4gznQvH/smiling-blonde-business-woman-posing-with-crossed-arms-171337-6291.jpg",
        "phone": "+1555666777",
        "email": "jennifer.wilson@example.com"
    },
    {
        "id": 5,
        "estate_title": "Luxurious Waterfront Condo",
        "segment_name": "Luxury",
        "description": "Experience waterfront living at its finest in this luxurious condo overlooking the serene marina. Boasting contemporary design and unparalleled amenities, this residence offers a lifestyle of luxury and comfort. Floor-to-ceiling windows frame breathtaking views of the water, while the open-concept layout creates an airy and inviting atmosphere. The gourmet kitchen is a chef's delight, featuring high-end appliances and ample counter space for culinary endeavors. Step outside onto the private balcony to savor the tranquil views and fresh sea breeze. Residents have access to resort-style amenities, including a sparkling pool, fitness center, and concierge services. With a prime location in the prestigious Marina District, this condo offers the ultimate retreat from the hustle and bustle of city life while being just moments away from upscale dining, shopping, and entertainment options.",
        "price": "$3,500,000",
        "status": "sale",
        "area": "2500 sq ft",
        "apartment_id": "2333",
        "bed": "5",
        "bath": "3",
        "location": "Marina District",
        "facilities": [
            "living room",
            "swimming pool",
            "spa",
            "kitchen",
            "balcony",
            "private beach",
            "concierge service"
        ],
        "estate_image": "https://i.ibb.co/JCmp3p9/room-1.jpg",
        "agent_name": "David Miller",
        "agent_img": "https://i.ibb.co/gJjxnZp/amazing-cheerful-business-woman-standing-with-arms-crossed-171337-8479.jpg",
        "phone": "+1444333222",
        "email": "david.miller@example.com"
    },
    {
        "id": 6,
        "estate_title": "Elegant Townhouse in Gated Community",
        "segment_name": "Premium",
        "description": "Experience the epitome of luxury living in this elegant townhouse nestled within a prestigious gated community. Surrounded by lush landscaping and manicured gardens, this residence offers privacy, security, and tranquility. Step inside to discover a meticulously designed interior boasting high-end finishes and impeccable craftsmanship throughout. The spacious living areas are perfect for both relaxing and entertaining, while the gourmet kitchen is a chef's dream, featuring top-of-the-line appliances and custom cabinetry. Retreat to the serene outdoor patio to enjoy al fresco dining or bask in the sun in your own private oasis. Residents also have access to exclusive community amenities, including a fitness center, swimming pool, and clubhouse. Located in the coveted Greenville neighborhood, this townhouse offers a lifestyle of luxury and sophistication in a serene suburban setting.",
        "price": "$1,200,000",
        "status": "sale",
        "area": "2200 sq ft",
        "apartment_id": "3462",
        "bed": "2",
        "bath": "2",
        "location": "Greenville",
        "facilities": [
            "living room",
            "kitchen",
            "garden",
            "gym",
            "tennis court",
            "security"
        ],
        "estate_image": "https://i.ibb.co/JCmp3p9/room-1.jpg",
        "agent_name": "Sarah Davis",
        "agent_img": "https://i.ibb.co/fCjbR7x/portrait-young-woman-smiling-23-2149375011.jpg",
        "phone": "+1666777888",
        "email": "sarah.davis@example.com"
    }
]